using devCard_MVC.Models;
using Microsoft.AspNetCore.Mvc;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;

namespace devCard_MVC.View_Component
{
    public class ArticleViewComponent:ViewComponent
    {
        public IViewComponentResult Invoke()
        {
            List<Article> articles = new List<Article>
        {
            new Article(1,"آخرین پروژه ایران مال","سنبتکسبتک ت تب سبنست بت سنبت سبت سنبتکسب کسبشک تینیتکسیبت بتکب شک تبکشبنبتکسبتک ت تب سبنست بت سنبت سبت سنبتکسب کسبشک تینیتکسیبت بتکب شک تبکشبنبتکسبتک ت تب سبنست بت سنبت سبت سنبتکسب کسبشک تینیتکسیبت بتکب شک تبکشبنبتکسبتک ت تب سبنست بت سنبت سبت سنبتکسب کسبشک تینیتکسیبت بتکب شک تبکشب ","blog-post-thumb-card-2.jpg"),
            new Article(2,"آخرین پروژه پدیده شاندیز","سنبتکسبتک ت تب سبنست بت سنبت سبت سنبتکسب کسبشک تینیتکسیبت بتکب شک تبکشبنبتکسبتک ت تب سبنست بت سنبت سبت سنبتکسب کسبشک تینیتکسیبت بتکب شک تبکشبنبتکسبتک ت تب سبنست بت سنبت سبت سنبتکسب کسبشک تینیتکسیبت بتکب شک تبکشبنبتکسبتک ت تب سبنست بت سنبت سبت سنبتکسب کسبشک تینیتکسیبت بتکب شک تبکشب ","blog-post-thumb-card-3.jpg"),
            new Article(3,"برند های منتخب","سنبتکسبتک ت تب سبنست بت سنبت سبت سنبتکسب کسبشک تینیتکسیبت بتکب شک تبکشبنبتکسبتک ت تب سبنست بت سنبت سبت سنبتکسب کسبشک تینیتکسیبت بتکب شک تبکشبنبتکسبتک ت تب سبنست بت سنبت سبت سنبتکسب کسبشک تینیتکسیبت بتکب شک تبکشبنبتکسبتک ت تب سبنست بت سنبت سبت سنبتکسب کسبشک تینیتکسیبت بتکب شک تبکشب ","blog-post-thumb-card-4.jpg"),
            new Article(4,"سبک زندگی در قطب","سنبتکسبتک ت تب سبنست بت سنبت سبت سنبتکسب کسبشک تینیتکسیبت بتکب شک تبکشبنبتکسبتک ت تب سبنست بت سنبت سبت سنبتکسب کسبشک تینیتکسیبت بتکب شک تبکشبنبتکسبتک ت تب سبنست بت سنبت سبت سنبتکسب کسبشک تینیتکسیبت بتکب شک تبکشبنبتکسبتک ت تب سبنست بت سنبت سبت سنبتکسب کسبشک تینیتکسیبت بتکب شک تبکشب ","blog-post-thumb-card-5.jpg")
        };
            return View("_Article",articles);
        }
    }
}
